# List  - a = list[]  - Список
# Tuple - b = tuple() - Кортеж
# Array - arr = []    - Массив

# Конкретная разница:
#
# Размер не фиксирован, изменяемый: список (list)
# Размер фиксирован, изменяемый: массив (array)
# Размер фиксирован, неизменяемый: кортеж (tuple)

# Оператор break досрочно прерывает цикл, либо условие.
# Оператор continue начинает следующий проход цикла, минуя оставшееся тело цикла.


# Array - arr = []    - Массив

# Пустой массив:
# arr = []
#
# Массив строк в Python:
# arr = ['string1', 'string2', 'string3']

# Методы массивов (array) в python:

# array.append(х) - добавление элемента в конец массива.
# array.count(х) - возвращает количество вхождений х в массив.
# array.index(х) - номер первого вхождения x в массив.
# array.pop(i) - удаляет i-ый элемент из массива и возвращает его. По умолчанию удаляется последний элемент.
# array.remove(х) - удалить первое вхождение х из массива.
# array.reverse(x) - обратный порядок элементов в массиве.
